Repository: osamasandhu/haweyati--driver-supplier
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Our Services
ur: ہماری خدمات

# ourServicesDescription
source: Renting different sizes of construction dumpsters and different types of scaffolding. By just easy steps, it will be delivered to your site.
ur: مختلف سائز کے تعمیراتی ڈمپسٹرز اور مختلف قسم کے سہاروں کو کرایہ پر لینا۔ صرف آسان اقدامات کے ذریعہ ، اسے آپ کی سائٹ پر پہنچا دیا جائے گا۔

source: Our Products
ur: ہماری مصنوعات

# ourProductsDescription
source: You can buy any building & finishing materials as per your location & time schedule without contacting with any person.
ur: آپ کسی بھی شخص سے رابطہ کیے بغیر اپنے مقام اور وقت کے مطابق کسی بھی عمارت اور ختم کا سامان خرید سکتے ہیں۔

source: Our Trucks
ur: ہمارے ٹرک

# ourTrucksDescription
source: Need to transfer your materials?Rent the right truck type to suit your materials volume with the right price
ur: اپنے سامان کی منتقلی کی ضرورت ہے؟ صحیح قیمت کے ساتھ اپنے مواد کے حجم کے مطابق صحیح ٹرک پر کرایہ لیں

# paymentAndSecurity
source: Payment & Security
ur: ادائیگی اور سیکیورٹی

# paymentAndSecurityDescription
source: Pay with Mada, Visa/Mater Card and Apple pay for a secure & hands free deals, or choose cash on delivery option.
ur: مڈا ، ویزا / میٹر کارڈ اور ایپل کے ساتھ ادائیگی کریں ، محفوظ اور آزادانہ سودے کیلئے ادائیگی کریں ، یا کیش آن ڈلیوری کے آپشن کا انتخاب کریں۔

source: Skip
ur: چھوڑ دو

source: Get Started
ur: آو شروع کریں

source: Location
ur: مقام

# locationDescription
source: Please select your site location. This location will be used to show the services & delivering your items. You can edit this location at any time.
ur: براہ کرم اپنی سائٹ کا مقام منتخب کریں۔ یہ مقام خدمات کو ظاہر کرنے اور آپ کے سامان کی فراہمی کے لئے استعمال ہوگا۔ آپ کسی بھی وقت اس مقام میں ترمیم کرسکتے ہیں۔

source: Set Your Location
ur: اپنی جگہ مقرر کریں

source: Use Location?
ur: مقام استعمال کریں؟

# useLocationMessage1
source: This app wants to change your device settings.
ur: یہ ایپ آپ کے آلے کی ترتیبات کو تبدیل کرنا چاہتی ہے۔

# useLocationMessage2
source: Use Wifi and mobile networks for location
ur: مقام کیلئے وائی فائی اور موبائل نیٹ ورک استعمال کریں

source: Learn More
ur: اورجانیے

source: Fetching Current Coordinates
ur: موجودہ رابطہ کاروں کی بازیافت

source: Fetching Location Data
ur: مقام کا ڈیٹا بازیافت کرنا

source: Changing Language
ur: زبان بدل رہی ہے

source: YES
ur: جی ہاں

source: NO
ur: نہیں

source: Hello
ur: ہیلو

# explore
source: Explore our products and services
ur: ہماری مصنوعات اور خدمات کو دریافت کریں

# myOrders
source: My Order
ur: میرا حکم

source: Settings
ur: ترتیبات

source: Invite Friends
ur: دوستوں کو مدعو کریں

source: Rewards
ur: انعامات

# termsAndConditions
source: Terms & Conditions
ur: شرائط و ضوابط

source: Rate App
ur: شرح ایپ

# logout
source: Sign out
ur: باہر جائیں

source: Sign in
ur: سائن ان

# enterCredentials
source: Enter your Credentials
ur: اپنا فون نمبر اور پاس ورڈ درج کریں

source: Signing In
ur: سائن ان

source: Signing Out
ur: سائن آؤٹ

source: Show
ur: دکھائیں

source: Hide
ur: چھپائیں

source: Your Phone
ur: آپ کا فون

source: Your Password
ur: آپ کا پاس ورڈ

source: Forgot Password?
ur: پاسورڈ بھول گے؟

source: Scaffoldings
ur: سہاروں

source: Delivery Vehicles
ur: ڈلیوری گاڑیاں

source: Building Materials
ur: تعمیراتی مواد

source: Finishing Materials
ur: فنشنگ میٹریلز

source: Construction Dumpsters
ur: تعمیراتی ڈمپسٹرز

source: Vehicles
ur: گاڑیاں

source: Price
ur: قیمت

# nProducts
source: {count,plural, =1{1 Product} other{{count} Products}}
ur: {count,plural, =1{1 پروڈکٹ} other{{count} مصنوعات}}

source: Sign In as Driver
ur: بطور ڈرائیور سائن ان کریں

source: Sign In as Supplier
ur: بطور سپلائر سائن ان کریں

source: Sign Up as Driver
ur: بطور ڈرائیور سائن اپ کریں

source: Sign Up as Supplier
ur: بطور سپلائر سائن اپ کریں

source: Register Now
ur: ابھی رجسٹر کریں

# exitApp
source: Are you sure you want to exit this application?
ur: کیا آپ واقعی اس ایپلی کیشن سے باہر نکلنا چاہتے ہیں؟

# incorrectCredentials
source: You have entered an incorrect username or password
ur: آپ نے غلط صارف نام یا پاس ورڈ درج کیا ہے

# validatePassword
source: Please provide password
ur: براہ کرم پاس ورڈ مہیا کریں

# validatePhoneNo
source: Please provide phone number
ur: برائے مہربانی فون نمبر فراہم کریں

# notASupplier
source: You are not registered as a Supplier on this account
ur: آپ اس اکاؤنٹ پر سپلائر کی حیثیت سے رجسٹرڈ نہیں ہیں

# notADriver
source: You are not registered as a Driver on this account
ur: آپ اس اکاؤنٹ پر بطور ڈرائیور رجسٹرڈ نہیں ہیں

# underReview
source: Your account is being reviewed!
ur: آپ کے اکاؤنٹ کا جائزہ لیا جارہا ہے!

# accountRejected
source: Your account has been rejected!
ur: آپ کا اکاؤنٹ مسترد کردیا گیا ہے!

# accountApproved
source: Your account has been approved!
ur: آپ کے اکاؤنٹ کی منظوری دے دی گئی ہے!

source: Refreshing status
ur: تازگی کی کیفیت

# selectService
source: You must select at least one service
ur: آپ کو کم از کم ایک خدمت کا انتخاب کرنا چاہئے

# selectBranch
source: Please select Branch
ur: براہ کرم برانچ منتخب کریں

source: Signing Up
ur: سائن اپ

# enterReqInfo
source: Enter Required Information
ur: مطلوبہ معلومات درج کریں

source: Select Services
ur: خدمات منتخب کریں

# isSubBranch
source: It is a Sub Branch
ur: یہ ایک سب برانچ ہے

source: Address
ur: پتہ

# validateAddress
source: Please Enter Address
ur: براہ کرم ایڈریس درج کریں

source: Name
ur: نام

# validateName
source: Please Enter Name
ur: برائے کرم نام درج کریں

# licenseNo
source: License Number
ur: لائسنس نمبر

# validateLicenseNo
source: Please Enter License Number
ur: برائے کرم لائسنس نمبر درج کریں

source: Vehicle Details
ur: گاڑی کی تفصیلات

source: Vehicle Type
ur: گاڑی کی قسم

source: Vehicle Name
ur: گاڑی کا نام

source: Vehicle Model
ur: گاڑی کا ماڈل

source: Select Supplier
ur: سپلائر منتخب کریں

# validateVehicle
source: Please enter Vehicle Name
ur: برائے مہربانی گاڑی کا نام درج کریں

# validateModel
source: Please enter Vehicle Model
ur: برائے مہربانی گاڑیوں کا ماڈل درج کریں

source: Identification
ur: شناخت

# validateIdentification
source: Please enter identification
ur: براہ کرم شناخت درج کریں

source: Camera
ur: کیمرہ

source: Gallery
ur: گیلری

source: No Image selected
ur: کوئی تصویر منتخب نہیں کی گئی ہے

source: Welcome
ur: خوش آمدید

# newOrders
source: New
ur: نئے آرڈر

# acceptedOrders
source: Accepted
ur: قبول کر لیا

# dispatchedOrders
source: Dispatched
ur: روانہ

# completedOrders
source: Completed
ur: مکمل

source: Updating Profile
ur: پروفائل کو اپ ڈیٹ کرنا

source: Submit
ur: جمع کرائیں

source: Service Requests
ur: خدمت کی درخواستیں

source: My Profile
ur: میری پروفائل

source: Change Password
ur: پاس ورڈ تبدیل کریں

source: Verification
ur: تصدیق

# typeCode
source: Please type the verification code you received
ur: براہ کرم موصولہ توثیقی کوڈ ٹائپ کریں

# didntReceiveCode
source: Didn't receive a code?
ur: کوڈ نہیں ملا؟

source: Resend code?
ur: کوڈ پھر سے بھیجو؟

source: Wait for
ur: کا انتظار

source: Verifying OTP
ur: او ٹی پی کی تصدیق کرنا

source: Reset Password
ur: پاس ورڈ ری سیٹ

# enterPhoneIntFormat
source: Enter Your Phone Number in International Format to
ur: اپنا فون نمبر بین الاقوامی شکل میں درج کریں

source: Processing
ur: پروسیسنگ

# alreadyExistsDriver
source: A driver with this phone number already exists
ur: اس فون نمبر والا ڈرائیور پہلے سے موجود ہے

# alreadyExistsSupplier
source: A supplier with this phone number already exists
ur: اس فون نمبر والا سپلائر پہلے سے موجود ہے

# alreadyExistsProfile
source: profile already exists with this phone number.Are you sure you want to sync these accounts?
ur: پروفائل پہلے ہی اس فون نمبر کے ساتھ موجود ہے۔ کیا آپ واقعی ان اکاؤنٹس کو مطابقت پذیر بنانا چاہتے ہیں؟

# sureAcceptOrder
source: Are you sure you want to accept this order?
ur: کیا آپ واقعی اس آرڈر کو قبول کرنا چاہتے ہیں؟

source: Accept Order
ur: آرڈر قبول کریں

source: Accepting Order
ur: آرڈر کو قبول کرنا

# markCompleted
source: Mark as completed
ur: مکمل ہونے پر نشان زد کریں

source: Subtotal
ur: کل

source: Delivery Fee
ur: ترسیل کی فیس

source: Total
ur: کل

source: Quantity
ur: مقدار

# inputValidPhone
source: Please input a valid phone number.
ur: براہ کرم ایک درست فون نمبر ان پٹ کریں۔

source: Notifications
ur: اطلاعات

source: Loading Notifications
ur: نوٹیفیکیشن لوڈ ہو رہا ہے

source: No Notifications
ur: کوئی اطلاع نہیں ہے

source: Loading Accepted Orders
ur: قبول شدہ احکامات کو لوڈ کیا جارہا ہے

source: Drop-off Address
ur: ڈراپ آف ایڈریس

source: Years Ago
ur: کئی برس قبل

source: One Year Ago
ur: ایک سال پہلے

source: Last Year
ur: پچھلے سال

source: Months Ago
ur: مہینوں پہلے

# oneMonthAgo
source: 1 Month Ago
ur: 1 ماہ پہلے

source: Last Month
ur: پچھلے مہینے

source: Weeks Ago
ur: ہفتوں پہلے

# oneWeekAgo
source: 1 Week Ago
ur: 1 ہفتہ پہلے

source: Last Week
ur: پچھلا ہفتہ

source: Days Ago
ur: دنوں پہلے

# oneDayAgo
source: 1 Day Ago
ur: 1 دن قبل

source: Yesterday
ur: کل

source: hours ago
ur: گھنٹوں پہلے

# oneHourAgo
source: 1 hour ago
ur: 1 گھنٹہ پہلے

source: An hour ago
ur: ایک گھنٹے پہلے

source: minutes ago
ur: کچھ لمحے قبل

source: A minute ago
ur: ایک منٹ پہلے

# oneMinuteAgo
source: 1 minute ago
ur: 1 منٹ پہلے

source: Seconds ago
ur: سیکنڈ پہلے

source: Just now
ur: ابھی ابھی

source: Need Help?
ur: مدد چاہیے؟

source: Available for Call
ur: کال کے لئے دستیاب ہے

source: Get Help
ur: مدد حاصل کرو

source: Not
ur: نہیں

source: Available Services
ur: دستیاب خدمات

# availableDumpsters
source: Available Dumpster
ur: دستیاب ڈمپسٹر

source: Scaffolding Request
ur: سہاروں کی درخواست

source: Pricing
ur: قیمتوں کا تعین

source: Days
ur: دن

source: Rent
ur: کرایہ

source: Extra Day Rent
ur: اضافی دن کا کرایہ

source: Note
ur: نوٹ

source: Description
ur: تفصیل

source: No Location Picked
ur: کوئی مقام نہیں اٹھایا

source: Submitting Request
ur: درخواست جمع کروانا

# requestSubmitted
source: Request submitted successfully! Request No :
ur: درخواست کامیابی کے ساتھ جمع کرائی گئی! درخواست نمبر :

source: Add Dumpster
ur: ڈمپسٹر شامل کریں

source: Size
ur: سائز

source: Helper Price
ur: مددگار قیمت

# availableBMCats
source: Available Building Material Categories
ur: دستیاب بلڈنگ میٹریل کیٹیگریز

# availableFMCats
source: Available Finishing Material Categories
ur: دستیاب فنیشنگ میٹری کیٹیگریز

source: Available
ur: دستیاب

source: Products
ur: مصنوعات

source: Add Building Material
ur: عمارت کا مواد شامل کریں

# twelveYardPrice
source: 12 Yard Price
ur: 12 یارڈ قیمت

# twentyFourYardPrice
source: 24 Yard Price
ur: 24 یارڈ قیمت

source: Add Finishing Material
ur: فنشنگ میٹریل شامل کریں

# multipleVariantCheck
source: This product has multiple variants
ur: اس کی مصنوعات میں متعدد قسمیں ہیں

source: Options
ur: اختیارات

source: Add Options
ur: اختیارات شامل کریں

source: Account
ur: کھاتہ

source: Edit Profile
ur: پروفائل میں ترمیم کریں

source: Email
ur: ای میل

source: Old Password
ur: پرانا پاسورڈ

source: New Password
ur: نیا پاس ورڈ

source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

# passwordUpdated
source: Your password has been updated successfully!
ur: آپ کا پاس ورڈ کامیابی کے ساتھ اپ ڈیٹ ہو گیا ہے!

# enterOldPassword
source: Please Enter Old Password
ur: براہ کرم پرانا پاس ورڈ درج کریں

# atLeastEight
source: Password must be at least 8 characters
ur: پاس ورڈ کم از کم 8 حروف کا ہونا ضروری ہے

# enterNewPassword
source: Please Enter New Password
ur: براہ کرم نیا پاس ورڈ درج کریں

# confirmNewPassword
source: Please Confirm New Password
ur: براہ کرم نئے پاس ورڈ کی توثیق کریں

# passwordNotMatched
source: New and Confirm Passwords not matched
ur: نئے اور تصدیق شدہ پاس ورڈز کا مماثل نہیں ہے

source: Changing Password
ur: پاس ورڈ تبدیل کرنا

source: No Accepted Orders
ur: کوئی قبول شدہ احکامات نہیں

source: Loading Completed Orders
ur: مکمل احکامات لوڈ ہو رہا ہے

source: No Completed Orders
ur: کوئی مکمل احکامات نہیں

source: Loading Dispatched Orders
ur: بھیجے گئے احکامات لوڈ ہو رہے ہیں

source: No Dispatched Orders
ur: بھیجے گئے احکامات نہیں

source: Loading Available Orders
ur: دستیاب آرڈر لوڈ ہو رہا ہے

source: No Available Orders
ur: دستیاب احکامات نہیں

source: Payment Type
ur: ادائیگی کی قسم

# changedVehicleInfo
source: You have changed vehicle's information. Your account will be on hold until verification process is completed!
ur: آپ نے گاڑی کی معلومات کو تبدیل کردیا ہے۔ تصدیق کا عمل مکمل ہونے تک آپ کا کھاتہ ہولڈ رہے گا!

source: Proceed
ur: آگے بڑھو

source: Cancel
ur: منسوخ کریں

source: Warning
ur: انتباہ
